b - year
// год, проверяемый на високосность

sum - sumFrom1toN
// сумма чисел от 1 до заданного N

x - vulnerabilityСode
// код уязвимости роутера

n2 - counterOfMark2
// счетчик оценок "2" в журнале успеваемости

x - currentPrice
// текущая цена для проверки на мин/макс

Y - digitToBeDel
// цифра, которую нужно удалить из заданного числа

i - count
// cчетчик количества итераций

k - matchCount
// счетчик количества совпадений

x - equality
// логическая переменная для проверки равенства

k - currentPosition
// текущая позиция при переборе строки

tree_c - treeCopy
// копия массива с данными дерева жизни

N - sunlinesNum
// количество подстрок