/*

6.1. 

1) T - dateTime (переменная для часа встречи)
2) center - centerFlower (цветок, стоящий по центру)
3) sum - happyTicketSum (сумма чисел для проверки билета на счастливость)
4) keys - randomKeys (массив случайных ключей)
5) s1, s2 - missedShots, hitShots (количество промахов и попаданий)

6.2.

1) Переменные (поля) связных списков - head, tail.
2) Байтовый массив hash для работы с хеш-функцией.
3) Двумерный массив чисел matrix.
4) Прозвольное положительное число epsilon.

6.3.

1) В начале второго курса мы создавали первые классы, 
и я создавал их на основе юнитов из компьютерной игры Warhammer 40k.
Переменная health отвечала за здоровье юнита, переменная 
moral - за моральный дух

2) Массив чисел wait_time для записи времени ожидания на светофорах.

3) Переменная star для подсчета количества зведочек в строке.

6.4.

1) health - healthValue
2) moral - moralValue
3) star - starCount
4) year - leapYear (проверка года на високосность)

*/

